src/main/vfabric/tsung/templates/create_users.xml
<?xml version="1.0" encoding="UTF-8" ?>
<!DOCTYPE tsung SYSTEM "??/tsung-1.3.3/tsung-1.0.dtd">
<tsung loglevel="warning" version="1.0" dumptraffic="light">
	%%CLIENTS%%
	%%SERVERS%%
	<load>
		<arrivalphase phase="1" duration="%%ARRIVAL_DURATION_IN_MINUTES%%" unit="minute">
			<users arrivalrate="%%ARRIVAL_RATE_PER_SECOND%%" unit="second" />
		</arrivalphase>
	</load>
	<options>
		<option type="ts_http" name="user_agent" />
		<option name="file_server" id="users" value="%%USERS_CSV_FILE%%"" />
	</options>
	<sessions>
		<session name="user_creation" probability="100" type="ts_http">
			<setdynvars sourcetype="file" fileid="users" delimiter=","
				order="iter">
				<var name="firstname" />
				<var name="lastname" />
				<var name="mail" />
				<var name="password" />
			</setdynvars>
			<transaction name="user_creation_tx">
				<request subst="true">
					<match do="log" when="match">HTTP/1.1 201 Created</match>
					<match do="abort" when="nomatch">HTTP/1.1 201 Created</match>
					<http url="/api/user" method="POST" version="1.1"
						contents='{&quot;firstname&quot;:&quot;%%_firstname%%&quot;,&quot;lastname&quot;:&quot;%%_lastname%%&quot;,&quot;mail&quot;:&quot;%%_mail%%&quot;,&quot;password&quot;:&quot;%%_password%%&quot;}'>
						<http_header name="Content-type" value="application/json" />
					</http>
				</request>
			</transaction>
		</session>
	</sessions>
</tsung>