src/main/vfabric/tsung/templates/launch.xml
<?xml version="1.0" encoding="UTF-8" ?>
<!DOCTYPE tsung SYSTEM "??/tsung-1.3.3/tsung-1.0.dtd">
<tsung loglevel="warning" version="1.0" dumptraffic="light">
	%%CLIENTS%%
	%%SERVERS%%
	<load>
		<arrivalphase phase="1" duration="%%ARRIVAL_DURATION_IN_MINUTES%%" unit="minute">
			<users arrivalrate="%%ARRIVAL_RATE_PER_SECOND%%" unit="second" />
		</arrivalphase>
	</load>
	<options>
		<option type="ts_http" name="user_agent" />
		<option name="file_server" id="game_content" value="game" />
		<option name="file_server" id="key" value="authentication_key" />
	</options>
	<sessions>
		<session name="launch_game" probability="100" type="ts_http">
			<setdynvars sourcetype="file" fileid="game_content"
				delimiter="%%" order="iter">
				<var name="content" />
			</setdynvars>
			<setdynvars sourcetype="file" fileid="key" delimiter="%%"
				order="iter">
				<var name="key" />
			</setdynvars>
			<request subst="true">
				<match do="log" when="match">HTTP/1.1 201 Created</match>
				<match do="log" when="nomatch">HTTP/1.1 201 Created</match>
				<http url="/api/game" method="POST" version="1.1"
					contents='{&quot;authentication_key&quot;:&quot;%%_key%%&quot;,&quot;parameters&quot;:&quot;%%_content%%&quot;}'>
					<http_header name="Content-type" value="application/json" />
				</http>
			</request>
		</session>
	</sessions>
</tsung>